---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileReadOptions.FileName
source: html/e8295982-36af-8108-7002-d613f1419609.htm
---
# Autodesk.Revit.DB.IFC.IFCFileReadOptions.FileName Property

The full file name of the IFC file to be read.

## Syntax (C#)
```csharp
public string FileName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null